INSERT INTO tariff_description (description)
VALUES ('Полный'),
       ('Junior'),
       ('Больше пространства'),
       ('День рождения'),
       ('Сопровождающий');


INSERT INTO service_class (class)
VALUES ('Сидячее место'),
       ('Плацкарт'),
       ('Купе'),
       ('СВ'),
       ('Люкс'),
       ('Купе-переговорная'),
       ('Первый класс'),
       ('Бизнес класс'),
       ('Вагон-бистро'),
       ('Эконом+'),
       ('Эконом');


INSERT INTO discount_category (category)
VALUES ('Без скидки'),
       ('Дети до 10 лет'),
       ('Школьники старше 10 лет и студенты'),
       ('Пенсионеры'),
       ('Групповая поездка');


INSERT INTO tariff (description_id, service_class_id, bed_linen, insurance, discount_category_id)
VALUES (2, 2, TRUE, FALSE, 3),
       (1, 2, TRUE, TRUE, DEFAULT),
       (1, 11, FALSE, TRUE, DEFAULT),
       (2, 11, FALSE, TRUE, 2),
       (1, 3, TRUE, TRUE, DEFAULT),
       (1, 3, TRUE, TRUE, 2),
       (1, 5, TRUE, TRUE, DEFAULT),
       (1, 4, TRUE, TRUE, 4);


INSERT INTO train_designation (designation)
VALUES ('Скорые круглогодичного обращения'),                                          --1-150
       ('Скорые круглогодичного и сезонного обращения'),                              --151-298
       ('Пассажирские круглогодичного обращения'),                                    --301-398
       ('Пассажирские сезонного обращения'),                                          --401- 498
       ('Пассажирские разового обращения, вывозные'),                                 --501-598
       ('Местные (межобластные)'),                                                    --601-698
       ('Скоростные'),                                                                --701-798
       ('Скорые составами дизель-поезда или электропоезда'),                          --801-848
       ('Скорые составами дизель-поезда или электропоезда без предоставления услуг'), --851-898
       ('Туристско-экскурсионные');                                                   --971-988


INSERT INTO train (number, designation_id, departure_point, destination_point, departure_time, arrival_time,
                   travel_time_days, travel_time_hours, travel_time_minutes)
VALUES ('112М', 1, 'Москва', 'Круглое поле', '23:40', '22:16', DEFAULT, 22, 36),
       ('112Й', 1, 'Круглое поле', 'Москва', '7:59', '05:30', DEFAULT, 21, 31),
       ('259А', 2, 'Санкт-Петербург', 'Анапа', '17:34', '13:10', 1, 19, 36),
       ('306М', 3, 'Москва', 'Сухум', '19:50', '10:43', 1, 14, 53),
       ('104В', 1, 'Москва', 'Адлер', '10:50', '10:24', DEFAULT, 23, 34),
       ('392У', 3, 'Москва', 'Челябинск', '12:25', '06:00', 1, 17, 35),
       ('059С', 1, 'Кисловодск', 'Новокузнецк', '18:50', '10:32', 3, 15, 42),
       ('049Й', 1, 'Самара', 'Москва', '15:44', '05:40', DEFAULT, 14, 56),
       ('050М', 1, 'Москва', 'Самара', '17:50', '09:36', DEFAULT, 14, 46),
       ('001А', 1, 'Санкт-Петербург', 'Москва', '23:55', '07:55', DEFAULT, 8, DEFAULT),
       ('002А', 1, 'Москва', 'Санкт-Петербург', '23:55', '07:55', DEFAULT, 8, DEFAULT),
       ('772А', 7, 'Москва', 'Санкт-Петербург', '15:30', '19:15', DEFAULT, 3, 45),
       ('775А', 7, 'Санкт-Петербург', 'Москва', '17:00', '20:50', DEFAULT, 3, 50),
       ('002Э', 1, 'Москва', 'Владивосток', '00:35', '06:03', 6, 22, 28);


INSERT INTO railway_trip (train_id, carriage_count)
VALUES (1, DEFAULT),
       (12, 10),
       (13, 10),
       (3, 13),
       (2, DEFAULT),
       (8, 12),
       (12, 10),
       (7, 10);


        /*(4, 11, DEFAULT),
        (5, 12, DEFAULT),
        (6, 14, DEFAULT),
        (9, 8, DEFAULT),
        (10, 17, DEFAULT),
        (11, 17, DEFAULT),
        (14, DEFAULT, DEFAULT);*/

INSERT INTO passenger (last_name, name, patronymic, sex, date_of_birth, passport, country_code, email, phone_number, birth_certificate)
VALUES ('Нестеров', 'Павел', 'Викторович', 'М', '2002-7-13', '4516999999', 'RUS', 'npv@mail.ru', '89990000001', NULL),
       ('Васильков', 'Виктор', 'Павлович', 'М', '1970-8-11', '4516999997', 'RUS', 'vvp@mail.ru', '89990000002', NULL),
       ('Добровольская', 'Ксения', 'Леонидовна', 'Ж', '1992-2-3', '4516999996', 'RUS', 'dkl@mail.ru', '89990000003', NULL),
       ('Ларионова', 'Татьяна', 'Филипповна', 'Ж', '1984-5-29', '4516999995', 'RUS', 'ltf@mail.ru', '89990000004', NULL),
       ('Денисов', 'Юрий', 'Иванович', 'М', '1999-6-12', '4516999994', 'RUS', 'dyi@mail.ru', '89990000005', NULL),
       ('Шевченко', 'Наталья', 'Георгиевна', 'Ж', '1978-10-25', '4516999993', 'RUS', 'sng@mail.ru', '89990000006', NULL),
       ('Ларин', 'Александр', 'Александрович', 'М', '1945-8-21', '4516999992', 'RUS', 'laa@mail.ru', '89990000007', NULL),
       ('Преображенская', 'Дарья', 'Романовна', 'Ж', '1984-7-15', '4516999991', 'RUS', 'pdr@mail.ru', '89990000008', NULL),
       ('Анисимов', 'Григорий', 'Фёдорович', 'М', '1958-1-19', '4516999990', 'RUS', 'agf@mail.ru', '89990000009', NULL),
       ('Канаева', 'Дарья', 'Юрьевна', 'Ж', '1992-9-1', '4516999989', 'RUS', NULL, '89990000010', NULL),
       ('Полякова', 'Евгения', 'Максимовна', 'Ж', '1995-2-22', '4516999988', 'RUS', 'pem@mail.ru', '89990000011', NULL),
       ('Поляков', 'Андрей', 'Сергеевич', 'М', '1994-6-4', '4516999987', 'RUS', 'pas@mail.ru', '89990000012', NULL),
       ('Полякова', 'Анастасия', 'Андреевна', 'Ж', '2016-11-14', NULL, 'RUS', NULL, NULL, 'IIIАМ234501'),
       ('Поляков', 'Дмитрий', 'Андреевич', 'М', '2018-2-2', NULL, 'RUS', NULL, NULL, 'IIIАМ234502'),
       ('Ли', 'Вероника', 'Вячеславовна', 'Ж', '1981-12-15', '4516999986', 'KAZ', NULL, '89990000015', NULL),
       ('Сахарова', 'Ксения', 'Игоревна', 'Ж', '2002-11-2', '4516999985', 'RUS', 'ski@mail.ru', '89990000016', NULL),
       ('Сахаров', 'Денис', 'Игоревич', 'М', '2000-3-20', '4516999984', 'KAZ', 'sdi@mail.ru', '89990000017', NULL),
       ('Иванов', 'Павел', 'Валентинович', 'М', '1974-9-30', '4516999983', 'RUS', 'ipv@mail.ru', '89990000018', NULL),
       ('Фомина', 'Анастасия', 'Ивановна', 'Ж', '1974-6-18', '4516999982', 'KAZ', 'fai@mail.ru', '89990000019', NULL),
       ('Иванов', 'Егор', NULL, 'М', '1996-4-2', '4516999981', 'RUS', 'ie@mail.ru', '89990000020', NULL),
       ('Иванова', 'Марина', 'Викторовна', 'Ж', '1997-3-30', '4516999980', 'RUS', 'imv@mail.ru', '89990000021', NULL),
       ('Иванов', 'Андрей', 'Егорович', 'М', '2020-8-1', NULL, 'RUS', NULL, NULL, 'IIIАМ234503'),
       ('Васильева', 'Мария', 'Дмитриевна', 'Ж', '1982-7-11', '4516999979', 'RUS', 'vmd@mail.ru', '89990000023', NULL),
       ('Бондаренко', 'Александр', 'Фёдорович', 'М', '1938-6-7', '4516999978', 'RUS', 'baf@mail.ru', '89990000024', NULL),
       ('Высоцкий', 'Глеб', NULL, 'М', '2000-10-12', '4516999977', 'KAZ', NULL, '89990000025', NULL),
       ('Орлова', 'София', 'Захаровна', 'Ж', '1965-2-22', '4516999976', 'RUS', 'osz@mail.ru', '89990000026', NULL),
       ('Деревяшкин', 'Ярослав', 'Алексеевич', 'М', '2011-11-11', NULL, 'RUS', NULL, NULL, 'IIIАМ234504');


INSERT INTO ticket (passenger_id, railway_trip_id, tariff_id, departure_point, destination_point, departure_date_time,
                    arrival_date_time, carriage, seat, price)
VALUES (1, 1, 1, 'Москва', 'Круглое поле', '2022-05-09 23:40', '2022-06-02 22:16', 7, 36, 2460),
       (25, 1, 2, 'Москва', 'Круглое поле', '2022-05-10 23:40', '2022-06-02 22:16', 7, 35, 2460),

       (11, 2, 3, 'Москва', 'Санкт-Петербург', '2021-07-22 15:30', '2021-07-22 19:15', 2, 10, 3100),
       (12, 2, 3, 'Москва', 'Санкт-Петербург', '2021-07-22 15:30', '2021-07-22 19:15', 2, 11, 3100),
       (13, 2, 4, 'Москва', 'Санкт-Петербург', '2021-07-22 15:30', '2021-07-22 19:15', 2, 12, DEFAULT),
       (14, 2, 4, 'Москва', 'Санкт-Петербург', '2021-07-22 15:30', '2021-07-22 19:15', 2, 13, DEFAULT),
       (11, 3, 3, 'Санкт-Петербург', 'Москва', '2021-07-29 17:00', '2021-07-29 20:50', 5, 21, 2950),
       (12, 3, 3, 'Санкт-Петербург', 'Москва', '2021-07-29 17:00', '2021-07-29 20:50', 5, 24, 2950),
       (13, 3, 4, 'Санкт-Петербург', 'Москва', '2021-07-29 17:00', '2021-07-29 20:50', 5, 22, DEFAULT),
       (14, 3, 4, 'Санкт-Петербург', 'Москва', '2021-07-29 17:00', '2021-07-29 20:50', 5, 23, DEFAULT),

       (18, 4, 2, 'Москва', 'Краснодар', '2021-08-12 03:14', '2021-08-13 08:55', 7, 40, 3540),
       (19, 4, 2, 'Москва', 'Краснодар', '2021-08-12 03:14', '2021-08-13 08:55', 7, 41, 3540),
       (20, 4, 5, 'Москва', 'Краснодар', '2021-08-12 03:14', '2021-08-13 08:55', 7, 9, 3540),
       (21, 4, 5, 'Москва', 'Краснодар', '2021-08-12 03:14', '2021-08-13 08:55', 7, 10, 3540),
       (22, 4, 5, 'Москва', 'Краснодар', '2021-08-12 03:14', '2021-08-13 08:55', 8, 11, DEFAULT),

       (1, 5, 1, 'Круглое поле', 'Москва', '2013-08-30 07:59', '2013-08-31 05:30', 4, 18, 2210),

       (16, 6, 7, 'Сызрань', 'Москва', '2020-12-28 16:45', '2020-12-29 05:45', 1, 49, 10680),
       (17, 6, 7, 'Сызрань', 'Москва', '2020-12-28 16:45', '2020-12-29 05:45', 1, 50, 10680),

       (27, 7, 3, 'Москва', 'Санкт-Петербург', '2021-07-21 15:30', '2021-07-21 19:15', 8, 19, 3100),
       (27, 3, 3, 'Санкт-Петербург', 'Москва', '2021-07-29 17:00', '2021-07-29 20:50', 5, 7, 2950),

       (9, 8, 8, 'Пятигорск', 'Саратов', '2020-05-09 19:46', '2020-05-10 21:32', 1, 2, DEFAULT),
       (24, 8, 8, 'Пятигорск', 'Саратов', '2020-05-09 19:46', '2020-05-10 21:32', 1, 4, DEFAULT);